rinya101/SmartGarbageCart_Project_STM32/Config/Inc/PeripheralParamConfig.h
/* ----------------------- 指南针模块 配置 ------------------------- */
#define COMPASS_ADDR 0x58
#define COMPASS_DEFAULT_CONFIG()                      \
    (const compass_cfg_t)                             \
    {                                                 \
        /* RCC */                                     \
        .gpio_sda_rcc = RCC_AHB1Periph_GPIOB,         \
        .gpio_scl_rcc = RCC_AHB1Periph_GPIOA,         \
        .i2c_rcc = RCC_APB1Periph_I2C3, /* GPIO */    \
            .gpio_sda_port = GPIOB,                   \
        .gpio_scl_port = GPIOA,                       \
        .gpio_sda_source = GPIO_PinSource8,           \
        .gpio_scl_source = GPIO_PinSource8,           \
        .gpio_sda_af = GPIO_AF9_I2C3,                 \
        .gpio_scl_af = GPIO_AF_I2C3,                  \
        .gpio_sda_pin = GPIO_Pin_8,                   \
        .gpio_scl_pin = GPIO_Pin_8,                   \
        .gpio_sda_mode = GPIO_Mode_AF,                \
        .gpio_scl_mode = GPIO_Mode_AF,                \
        .gpio_sda_otype = GPIO_OType_OD,              \
        .gpio_scl_otype = GPIO_OType_OD,              \
        .gpio_sda_pu = GPIO_PuPd_UP,                  \
        .gpio_scl_pu = GPIO_PuPd_UP,                  \
        .gpio_sda_speed = GPIO_Speed_50MHz,           \
        .gpio_scl_speed = GPIO_Speed_50MHz, /* I2C */ \
            .i2c = I2C3,                              \
        .i2c_mode = I2C_Mode_I2C,                     \
        .i2c_duty = I2C_DutyCycle_2,                  \
        .i2c_own_addr = 0x00,                         \
        .i2c_ack = I2C_Ack_Enable,                    \
        .i2c_ack_addr = I2C_AcknowledgedAddress_7bit, \
        .i2c_speed = 100000, /* Base */               \
            .addr = COMPASS_ADDR                      \
    }
/* ----------------------- 蜂鸣器 配置 ------------------------- */
#define BUZZER_DEFAULT_CONFIG()                               \
    (buzzer_cfg_t)                                            \
    {                                                         \
        .gpio_rcc = RCC_AHB1Periph_GPIOB,                     \
        .tim_rcc = RCC_APB1Periph_TIM4,                       \
        .gpio_port = GPIOB,                                   \
        .gpio_pin = GPIO_Pin_9,                               \
        .timx = TIM4,                                         \
        .tim_channel = TIM_Channel_4,                         \
        .prescaler = 10 - 1, /* 100MHz /10 = 10MHz → 0.1us */ \
            .period = 10000, /* 1kHz 默认频率 */              \
            .duty = 1000,    /* 温和占空比 */                 \
    }

/* ----------------------- 马达 配置 ------------------------- */
#define MOTOR_DEFAULT_CONFIG()                          \
    (motor_cfg_t)                                       \
    {                                                   \
        /* RCC */                                       \
        .gpio_m1a_rcc = RCC_AHB1Periph_GPIOA,           \
        .gpio_m1b_rcc = RCC_AHB1Periph_GPIOB,           \
        .gpio_m2a_rcc = RCC_AHB1Periph_GPIOA,           \
        .gpio_m2b_rcc = RCC_AHB1Periph_GPIOB,           \
        .tim_rcc = RCC_APB1Periph_TIM2, /* GPIO PORT */ \
            .gpio_m1a_port = GPIOA,                     \
        .gpio_m1b_port = GPIOB,                         \
        .gpio_m2a_port = GPIOA,                         \
        .gpio_m2b_port = GPIOB, /* GPIO PIN */          \
            .gpio_m1a_pin = GPIO_Pin_0,                 \
        .gpio_m1b_pin = GPIO_Pin_10,                    \
        .gpio_m2a_pin = GPIO_Pin_1,                     \
        .gpio_m2b_pin = GPIO_Pin_12, /* MODE */         \
            .gpio_m1a_mode = GPIO_Mode_AF,              \
        .gpio_m1b_mode = GPIO_Mode_OUT,                 \
        .gpio_m2a_mode = GPIO_Mode_AF,                  \
        .gpio_m2b_mode = GPIO_Mode_OUT, /* OTYPER */    \
            .gpio_m1a_otype = GPIO_OType_PP,            \
        .gpio_m1b_otype = GPIO_OType_PP,                \
        .gpio_m2a_otype = GPIO_OType_PP,                \
        .gpio_m2b_otype = GPIO_OType_PP, /* SPEED */    \
            .gpio_m1a_speed = GPIO_Speed_100MHz,        \
        .gpio_m1b_speed = GPIO_Speed_100MHz,            \
        .gpio_m2a_speed = GPIO_Speed_100MHz,            \
        .gpio_m2b_speed = GPIO_Speed_100MHz, /* PUPD */ \
            .gpio_m1a_pu = GPIO_PuPd_NOPULL,            \
        .gpio_m1b_pu = GPIO_PuPd_NOPULL,                \
        .gpio_m2a_pu = GPIO_PuPd_NOPULL,                \
        .gpio_m2b_pu = GPIO_PuPd_NOPULL, /* AF */       \
            .gpio_m1a_pin_source = GPIO_PinSource0,     \
        .gpio_m2a_pin_source = GPIO_PinSource1,         \
        .gpio_m1a_af = GPIO_AF_TIM2,                    \
        .gpio_m2a_af = GPIO_AF_TIM2, /* TIM */          \
            .tim = TIM2,                                \
        .tim_channel1 = TIM_Channel_1,                  \
        .tim_channel2 = TIM_Channel_2,                  \
        .tim_pre = 100 - 1,                             \
        .tim_period = 1000 - 1,                         \
        .tim_div = TIM_CKD_DIV1,                        \
        .tim_mode = TIM_CounterMode_Up,                 \
        .tim_rep = 0,                                   \
    }

/* ----------------------- 舵机 配置 ------------------------- */
#define SERVO1_DEFAULT_CONFIG() (servo_cfg_t){ \
    .gpio_clk = RCC_AHB1Periph_GPIOB,          \
    .tim_clk = RCC_APB2Periph_TIM1,            \
    .gpio_port = GPIOB,                        \
    .gpio_pin = GPIO_Pin_13,                   \
    .gpio_af_src = GPIO_PinSource13,           \
    .gpio_af = GPIO_AF_TIM1,                   \
    .tim = TIM1,                               \
    .tim_prescaler = 100 - 1,                  \
    .tim_period = 20000 - 1,                   \
    .channel = TIM_Channel_1,                  \
    .duty = 1500}
#define SERVO2_DEFAULT_CONFIG() (servo_cfg_t){ \
    .gpio_clk = RCC_AHB1Periph_GPIOB,          \
    .tim_clk = RCC_APB2Periph_TIM1,            \
    .gpio_port = GPIOB,                        \
    .gpio_pin = GPIO_Pin_14,                   \
    .gpio_af_src = GPIO_PinSource14,           \
    .gpio_af = GPIO_AF_TIM1,                   \
    .tim = TIM1,                               \
    .tim_prescaler = 100 - 1,                  \
    .tim_period = 20000 - 1,                   \
    .channel = TIM_Channel_2,                  \
    .duty = 1500}
#define SERVO3_DEFAULT_CONFIG() (servo_cfg_t){ \
    .gpio_clk = RCC_AHB1Periph_GPIOB,          \
    .tim_clk = RCC_APB2Periph_TIM1,            \
    .gpio_port = GPIOB,                        \
    .gpio_pin = GPIO_Pin_15,                   \
    .gpio_af_src = GPIO_PinSource15,           \
    .gpio_af = GPIO_AF_TIM1,                   \
    .tim = TIM1,                               \
    .tim_prescaler = 100 - 1,                  \
    .tim_period = 20000 - 1,                   \
    .channel = TIM_Channel_3,                  \
    .duty = 1500}

/* ----------------------- 电池电量采集 配置 ------------------------- */
#define BATTERY_DEFAULT_CONFIG()          \
    (const battery_cfg_t)                 \
    {                                     \
        .gpio_clk = RCC_AHB1Periph_GPIOA, \
        .adc_clk = RCC_APB2Periph_ADC1,   \
        .gpio_port = GPIOA,               \
        .gpio_pin = GPIO_Pin_5,           \
        .adc = ADC1,                      \
        .adc_channel = ADC_Channel_5,     \
        .offset = 1.106f,                 \
    }

#endif /* PeripheralParamConfig.h */